print('Задача 6. Пирамидка')

# Напишите программу,
# которая выводит на экран равнобедренный треугольник (пирамидку),
# заполненный символами хэштега "#". Пусть высота пирамиды вводится пользователем.

#   01234567|
# 0    #    |          03
# 1   ###   |       12 13 14
# 2  #####  |    21 22 23 24 25
# 3 ####### | 30 31 32 33 34 35 36
while True:
    num = int(input("Please, enter the number:\n>"))

    for row in range(num):
        for col in range(num * 2 - 1):
            if col + row >= num - 1:
                if row + col <= row * 2 + num - 1:
                    print("#", end="")
            else:
                print(" ", end="")
        print("")
